Table of Contents
 Class ErrorHandlerAttribute
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
For more details see https://www.c-sharpcorner.com/UploadFile/b182bf/centralize-exception-handling-in-wcf-part-10/
public class ErrorHandlerAttribute : Attribute, _Attribute, IServiceBehavior
Inheritance
object
Attribute
ErrorHandlerAttribute
Implements
_Attribute
IServiceBehavior
Inherited Members
 Attribute.GetCustomAttributes(MemberInfo, Type)
 Attribute.GetCustomAttributes(MemberInfo, Type, bool)
 Attribute.GetCustomAttributes(MemberInfo)
 Attribute.GetCustomAttributes(MemberInfo, bool)
 Attribute.IsDefined(MemberInfo, Type)
 Attribute.IsDefined(MemberInfo, Type, bool)
 Attribute.GetCustomAttribute(MemberInfo, Type)
 Attribute.GetCustomAttribute(MemberInfo, Type, bool)
 Attribute.GetCustomAttributes(ParameterInfo)
 Attribute.GetCustomAttributes(ParameterInfo, Type)
 Attribute.GetCustomAttributes(ParameterInfo, Type, bool)
 Attribute.GetCustomAttributes(ParameterInfo, bool)
 Attribute.IsDefined(ParameterInfo, Type)
 Attribute.IsDefined(ParameterInfo, Type, bool)
 Attribute.GetCustomAttribute(ParameterInfo, Type)
 Attribute.GetCustomAttribute(ParameterInfo, Type, bool)
 Attribute.GetCustomAttributes(Module, Type)
 Attribute.GetCustomAttributes(Module)
 Attribute.GetCustomAttributes(Module, bool)
 Attribute.GetCustomAttributes(Module, Type, bool)
 Attribute.IsDefined(Module, Type)
 Attribute.IsDefined(Module, Type, bool)
 Attribute.GetCustomAttribute(Module, Type)
 Attribute.GetCustomAttribute(Module, Type, bool)
 Attribute.GetCustomAttributes(Assembly, Type)
 Attribute.GetCustomAttributes(Assembly, Type, bool)
 Attribute.GetCustomAttributes(Assembly)
 Attribute.GetCustomAttributes(Assembly, bool)
 Attribute.IsDefined(Assembly, Type)
 Attribute.IsDefined(Assembly, Type, bool)
 Attribute.GetCustomAttribute(Assembly, Type)
 Attribute.GetCustomAttribute(Assembly, Type, bool)
 Attribute.Equals(object)
 Attribute.GetHashCode()
 Attribute.Match(object)
 Attribute.IsDefaultAttribute()
 Attribute.TypeId
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 ErrorHandlerAttribute(Type)
public ErrorHandlerAttribute(Type errorHandler)
Parameters
errorHandler Type
Methods
 AddBindingParameters(ServiceDescription, ServiceHostBase, Collection<ServiceEndpoint>, BindingParameterCollection)
Provides the ability to pass custom data to binding elements to support the contract implementation.
public void AddBindingParameters(ServiceDescription serviceDescription, ServiceHostBase serviceHostBase, Collection<ServiceEndpoint> endpoints, BindingParameterCollection bindingParameters)
Parameters
serviceDescription ServiceDescription
The service description of the service.
serviceHostBase ServiceHostBase
The host of the service.
endpoints Collection<ServiceEndpoint>
The service endpoints.
bindingParameters BindingParameterCollection
Custom objects to which binding elements have access.
 ApplyDispatchBehavior(ServiceDescription, ServiceHostBase)
Provides the ability to change run-time property values or insert custom extension objects such as error handlers, message or parameter interceptors, security extensions, and other custom extension objects.
public void ApplyDispatchBehavior(ServiceDescription serviceDescription, ServiceHostBase serviceHostBase)
Parameters
serviceDescription ServiceDescription
The service description.
serviceHostBase ServiceHostBase
The host that is currently being built.
 Validate(ServiceDescription, ServiceHostBase)
Provides the ability to inspect the service host and the service description to confirm that the service can run successfully.
public void Validate(ServiceDescription serviceDescription, ServiceHostBase serviceHostBase)
Parameters
serviceDescription ServiceDescription
The service description.
serviceHostBase ServiceHostBase
The service host that is currently being constructed.
 Edit this page